In [3]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [16]:
df = pd.read_csv('data.csv')

In [17]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [20]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [21]:
df.shape

(891, 12)

In [62]:
Dummy_data = [
    [1, 2, 3, 4],
    [1, 'Hello', 19.11],
    [1018, 1901.1, 1891.798497189, 1880]
]
data = pd.DataFrame(Dummy_data, columns=['A', 'B', 'C', 'D'])

In [63]:
data

      A       B            C       D
0     1       2     3.000000     4.0
1     1   Hello    19.110000     NaN
2  1018  1901.1  1891.798497  1880.0

In [64]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      object
 2   C       3 non-null      float64
 3   D       2 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 224.0+ bytes

In [65]:
data['C'] = data['C'].astype(np.int64)

In [66]:
data

      A       B     C       D
0     1       2     3     4.0
1     1   Hello    19     NaN
2  1018  1901.1  1891  1880.0

In [70]:
# Normalization Min Max Scaling
def min_max(data, columns):
    for i in columns:
        maxi = data[i].max()
        mini = data[i].min()
        def calculate(x):
            return ((x-mini)/(maxi-mini))
        data[i] = data[i].apply(calculate)
    return data

In [71]:
data = min_max(data, ['A','C','D'])

In [72]:
data

     A       B         C    D
0  0.0       2  0.000000  0.0
1  0.0   Hello  0.008475  NaN
2  1.0  1901.1  1.000000  1.0

In [58]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       3 non-null      object
 2   C       3 non-null      float64
 3   D       2 non-null      float64
dtypes: float64(3), object(1)
memory usage: 224.0+ bytes

In [82]:
## Categorical To Numerical

In [78]:
def cat(x):
    return int(x == 'male')

In [83]:
df['Sex'] = df['Sex'].apply(cat)

0      0
1      0
2      0
3      0
4      0
      ..
886    0
887    0
888    0
889    0
890    0
Name: Sex, Length: 891, dtype: int64

In [81]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S